Белгипрозем_2017/src/Catalogs/РолиИсполнителей/РолиИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиИсполнителей</name>
  <predefined>
    <items>
      <name>ОтветственныйЗаКонтрольИсполнения</name>
      <description>Координатор выполнения задач</description>
    </items>
    <items>
      <name>СотрудникСТКК</name>
      <description>Сотрудник СТКК</description>
    </items>
  </predefined>
  <attributes>
    <name>ИспользуетсяБезОбъектовАдресации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСОбъектамиАдресации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыДополнительногоОбъектаАдресации</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыОсновногоОбъектаАдресации</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяРоль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелОбмена</name>
    <type>
      <types>ExchangePlanRef.ОбменВнешнимиЗаданиямиС1СДокументооборот</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/РолиИсполнителей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру полей Роли
//
// Возвращаемое значение:
//   Структура
//     Наименование
//     КраткоеПредставление
//     ВнешняяРоль
//     ИспользуетсяБезОбъектовАдресации
//     ИспользуетсяСОбъектамиАдресации
//     ТипыОсновногоОбъектаАдресации
//     ТипыДополнительногоОбъектаАдресации
//     Комментарий
//
Функция ПолучитьСтруктуруРолиИсполнителей() Экспорт
	
	ПараметрыРолиИсполнителей = Новый Структура;
	ПараметрыРолиИсполнителей.Вставить("Код");
	ПараметрыРолиИсполнителей.Вставить("Наименование");
	ПараметрыРолиИсполнителей.Вставить("КраткоеПредставление");
	ПараметрыРолиИсполнителей.Вставить("ВнешняяРоль");
	ПараметрыРолиИсполнителей.Вставить("УзелОбмена");
	ПараметрыРолиИсполнителей.Вставить("ИспользуетсяБезОбъектовАдресации");
	ПараметрыРолиИсполнителей.Вставить("ИспользуетсяСОбъектамиАдресации");
	ПараметрыРолиИсполнителей.Вставить("ТипыОсновногоОбъектаАдресации");
	ПараметрыРолиИсполнителей.Вставить("ТипыДополнительногоОбъектаАдресации");
	ПараметрыРолиИсполнителей.Вставить("Комментарий");
	
	Возврат ПараметрыРолиИсполнителей;
	
КонецФункции

// Создает и запсывает в БД роль
//
// Параметры:
//   СтруктураРоли - Структура - структура полей роли.
//
// Возвращаемое значение:
//   СправочникСсылка.РолиИсполнителей
//
Функция СоздатьРольИсполнителей(СтруктураРоли) Экспорт
	
	НоваяРоль = СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НоваяРоль, СтруктураРоли);
	НоваяРоль.Записать();
	
	Возврат НоваяРоль.Ссылка;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти

#КонецЕсли
